Revit 2016 API
Face.GetRegions Method
Face regions (created with the Split Face command) of the face.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 16.0.0.0 (16.0.0.0)
Syntax
C#
public IList<Face> GetRegions()
Visual Basic
Public Function GetRegions As IList(Of Face)
Visual C++
public:
IList<Face^>^ GetRegions()
Return Value
A list of faces, one for the main face of the object hosting the Split Face (such as wall of floor) and one face for each Split Face regions.
Remarks
Use the FaceSplitter Class to filter and find these faces by type.
See Also
Face Class
Autodesk.Revit.DB Namespace